12/data/attachments/9e524b1daec9f26a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_2285751f-b641-4364-b570-3a4ef0958e6f</nif:username>
            <nif:friendToBeAdded>Robert_window_Friend_8846_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>